Repository: collective/collective.twitter.accounts
Catalog: src/collective/twitter/accounts/locales/*/LC_MESSAGES/collective.twitter.accounts.po
Languages: es

source: Application
es: Aplicación

source: Choose to use Plone's default tweet application or your own (you'll need to register one in dev.twitter.com)
es: Elija entre usar la aplicación predeterminada de Plone o una propia (Necesita registrarla en dev.twitter.com)

source: Consumer key for your application. Not used if "Plone default" chosen.
es: "Consumer key" para su aplicación. No se utiliza si se selecciona la aplicación predeterminada de Plone.

source: Consumer secret for your application. Not used if "Plone default" chosen.
es: "Consumer key" para su aplicación. No se utiliza si se selecciona la aplicación predeterminada de Plone.

source: Could not authorize. Perhaps wrong token provided.
es: No se pudo autorizar. Quizás se especificó un token incorrecto.

source: Custom
es: Propia

source: Lets you configure several twitter accounts
es: Le permite configurar diversas cuentas Twitter

source: Missing data.
es: Faltan datos.

source: Plone default
es: Predeterminada de Plone

source: Request twitter token
es: Pedir token de Twitter

source: Security token
es: Token de seguridad

source: Twitter account succesfully authorized.
es: Cuenta Twitter autenticada satisfactoriamente.

source: Twitter setup
es: Configuración Twitter

source: label_add
es: Agregar
